In [142]:
import numpy as np
import pandas as pd

## Tests

In [143]:
df = pd.DataFrame({
    'A': ['foo', 'bar', 'foo', 'baz', 'foo'],
    'B': [1, 2, 1, 3, 1]
})
df

     A  B
0  foo  1
1  bar  2
2  foo  1
3  baz  3
4  foo  1

In [144]:
df.duplicated(keep='first') # Marks the first occurance false (Not duplicated)

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [145]:
df.duplicated(keep='last') #Marks the last occurance false (Others are the ones considered duplicated)

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [146]:
df.duplicated(keep=False) #Marks all the duplicates true

0     True
1    False
2     True
3    False
4     True
dtype: bool

## My Practice

In [147]:
df = pd.read_csv('D:\\shaher\\amit\\Session 11 - Pandas cont\\Datasets\\DS_salaries.csv')
df.head()

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [148]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          607 non-null    int64
 1   work_year           607 non-null    int64
 2   experience_level    607 non-null    object
 3   employment_type     607 non-null    object
 4   job_title           607 non-null    object
 5   salary              607 non-null    int64
 6   salary_currency     607 non-null    object
 7   salary_in_usd       607 non-null    int64
 8   employee_residence  607 non-null    object
 9   remote_ratio        607 non-null    int64
 10  company_location    607 non-null    object
 11  company_size        607 non-null    object
dtypes: int64(5), object(7)
memory usage: 57.0+ KB

In [149]:
df.duplicated().sum()

np.int64(0)

In [150]:
df.columns

Index(['Unnamed: 0', 'work_year', 'experience_level', 'employment_type',
       'job_title', 'salary', 'salary_currency', 'salary_in_usd',
       'employee_residence', 'remote_ratio', 'company_location',
       'company_size'],
      dtype='object')

In [151]:
df.drop(columns=['Unnamed: 0'], inplace=True)

In [152]:
df.duplicated().sum()

np.int64(42)

In [153]:
df.duplicated(keep=False).sum()

np.int64(71)

In [154]:
df.drop_duplicates(inplace=True)

In [155]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 565 entries, 0 to 606
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           565 non-null    int64
 1   experience_level    565 non-null    object
 2   employment_type     565 non-null    object
 3   job_title           565 non-null    object
 4   salary              565 non-null    int64
 5   salary_currency     565 non-null    object
 6   salary_in_usd       565 non-null    int64
 7   employee_residence  565 non-null    object
 8   remote_ratio        565 non-null    int64
 9   company_location    565 non-null    object
 10  company_size        565 non-null    object
dtypes: int64(4), object(7)
memory usage: 53.0+ KB

In [156]:
df.reset_index(drop=True, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 565 entries, 0 to 564
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           565 non-null    int64
 1   experience_level    565 non-null    object
 2   employment_type     565 non-null    object
 3   job_title           565 non-null    object
 4   salary              565 non-null    int64
 5   salary_currency     565 non-null    object
 6   salary_in_usd       565 non-null    int64
 7   employee_residence  565 non-null    object
 8   remote_ratio        565 non-null    int64
 9   company_location    565 non-null    object
 10  company_size        565 non-null    object
dtypes: int64(4), object(7)
memory usage: 48.7+ KB

In [157]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [158]:
# categorical_columns = ['experience_level', 'employment_type', 'job_title', 'salary_currency', 'employee_residence', 'company_location', 'company_size']
# df[categorical_columns] = df[categorical_columns].astype('object')
# df.info()

In [159]:
df.select_dtypes('object') #Returns the columns that their datatypes are object, and their rows

,experience_level,employment_type,job_title,salary_currency,employee_residence,company_location,company_size
0,MI,FT,Data Scientist,EUR,DE,DE,L
1,SE,FT,Machine Learning Scientist,USD,JP,JP,S
2,SE,FT,Big Data Engineer,GBP,GB,GB,M
3,MI,FT,Product Data Analyst,USD,HN,HN,S
4,SE,FT,Machine Learning Engineer,USD,US,US,L
...,...,...,...,...,...,...,...
560,SE,FT,Data Engineer,USD,US,US,M
561,SE,FT,Data Engineer,USD,US,US,M
562,SE,FT,Data Analyst,USD,US,US,M
563,SE,FT,Data Analyst,USD,US,US,M
564,MI,FT,AI Scientist,USD,IN,US,L

In [160]:
df[df.select_dtypes('object').columns] = df.select_dtypes('object').astype('category') # select_dtypes('object) -> btrg3 subset mn el dataframe el datatypes bta3to 'object'
df.info() # select_dtypes('object').astype('category'), bt8yr el goz2 dh (dataframe nafsha msh columns) l category

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 565 entries, 0 to 564
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           565 non-null    int64
 1   experience_level    565 non-null    category
 2   employment_type     565 non-null    category
 3   job_title           565 non-null    category
 4   salary              565 non-null    int64
 5   salary_currency     565 non-null    category
 6   salary_in_usd       565 non-null    int64
 7   employee_residence  565 non-null    category
 8   remote_ratio        565 non-null    int64
 9   company_location    565 non-null    category
 10  company_size        565 non-null    category
dtypes: category(7), int64(4)
memory usage: 30.2 KB

In [161]:
# df[df.select_dtypes('int64').columns] = df.select_dtypes('int64').astype('int32')
# df.info() # Size is 13.6KB, but risky as some numbers may be cut down (changed)

In [162]:
df.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [163]:
df.duplicated().sum()

np.int64(0)

In [165]:
df['work_year'].value_counts()

work_year
2022    278
2021    215
2020     72
Name: count, dtype: int64

## Visualiztion

In [166]:
df['company_size'].value_counts()

company_size
M    290
L    193
S     82
Name: count, dtype: int64

In [167]:
df['experience_level'].value_counts()

experience_level
SE    243
MI    208
EN     88
EX     26
Name: count, dtype: int64

In [168]:
df['employment_type'].value_counts()

employment_type
FT    546
PT     10
CT      5
FL      4
Name: count, dtype: int64